backend/templates/CadastraTickerGuardian.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <CadastraTicketGuardian xmlns="http://toledobrasil.com.br/WS_Guardian">
      <DadosTicket>
        <Codigo>string</Codigo>
        <PlacaCarreta>string</PlacaCarreta>
        <PlacaVeiculo>string</PlacaVeiculo>
        <Transportadora>
          <RazaoSocial>string</RazaoSocial>
          <Cnpj>string</Cnpj>
          <InscricaoEstadual>string</InscricaoEstadual>
          <Endereco>string</Endereco>
          <Complemento>string</Complemento>
          <Municipio>string</Municipio>
          <UF>string</UF>
          <Cep>string</Cep>
          <Telefone>string</Telefone>
          <Observacao>string</Observacao>
          <Email>string</Email>
          <Estado>int</Estado>
          <TipoDocumento>int</TipoDocumento>
          <IncluiAtualiza>boolean</IncluiAtualiza>
        </Transportadora>
        <Emissor>
          <TipoEmissor>int</TipoEmissor>
          <RazaoSocial>string</RazaoSocial>
          <Cnpj>string</Cnpj>
          <InscricaoEstadual>string</InscricaoEstadual>
          <Endereco>string</Endereco>
          <Complemento>string</Complemento>
          <Municipio>string</Municipio>
          <UF>string</UF>
          <Cep>string</Cep>
          <Telefone>string</Telefone>
          <Email>string</Email>
          <Observacao>string</Observacao>
          <Estado>int</Estado>
          <TipoDocumento>int</TipoDocumento>
          <IncluiAtualiza>boolean</IncluiAtualiza>
        </Emissor>
        <Motorista>
          <Cpf>string</Cpf>
          <Rg>string</Rg>
          <Nome>string</Nome>
          <Cnh>string</Cnh>
          <Estado>int</Estado>
          <Observacao>string</Observacao>
          <InfoAcompanhantes>string</InfoAcompanhantes>
          <Nacionalidade>string</Nacionalidade>
          <DataNascimento>dateTime</DataNascimento>
          <DocEstrangeiro>string</DocEstrangeiro>
          <IncluiAtualiza>boolean</IncluiAtualiza>
          <OrgaoExpedidorRG>string</OrgaoExpedidorRG>
          <UFRG>int</UFRG>
          <Identificador>string</Identificador>
          <LoginGuardianFacil>string</LoginGuardianFacil>
          <Celular>string</Celular>
          <Email>string</Email>
        </Motorista>
        <Item>
          <ItemIntegracao>
            <Tipo>int</Tipo>
            <Nome>string</Nome>
            <Informacao>string</Informacao>
            <PesoUnitario>decimal</PesoUnitario>
            <UnidadeMedida>string</UnidadeMedida>
            <PodeConverter>boolean</PodeConverter>
            <FatorConversao>decimal</FatorConversao>
            <UnidadeMedidaConversao>string</UnidadeMedidaConversao>
            <UtilizaContador>boolean</UtilizaContador>
            <InicioContador>int</InicioContador>
            <FinalContador>int</FinalContador>
            <PrefixoContador>int</PrefixoContador>
            <Estado>int</Estado>
            <CodigoFatorCorrecao>string</CodigoFatorCorrecao>
            <CodigoFluxo>string</CodigoFluxo>
            <InicialObrigatoria>boolean</InicialObrigatoria>
            <QuantidadeViasRelatorioImpressas>int</QuantidadeViasRelatorioImpressas>
            <IncluiAtualiza>boolean</IncluiAtualiza>
          </ItemIntegracao>
          <ItemIntegracao>
            <Tipo>int</Tipo>
            <Nome>string</Nome>
            <Informacao>string</Informacao>
            <PesoUnitario>decimal</PesoUnitario>
            <UnidadeMedida>string</UnidadeMedida>
            <PodeConverter>boolean</PodeConverter>
            <FatorConversao>decimal</FatorConversao>
            <UnidadeMedidaConversao>string</UnidadeMedidaConversao>
            <UtilizaContador>boolean</UtilizaContador>
            <InicioContador>int</InicioContador>
            <FinalContador>int</FinalContador>
            <PrefixoContador>int</PrefixoContador>
            <Estado>int</Estado>
            <CodigoFatorCorrecao>string</CodigoFatorCorrecao>
            <CodigoFluxo>string</CodigoFluxo>
            <InicialObrigatoria>boolean</InicialObrigatoria>
            <QuantidadeViasRelatorioImpressas>int</QuantidadeViasRelatorioImpressas>
            <IncluiAtualiza>boolean</IncluiAtualiza>
          </ItemIntegracao>
        </Item>
        <Documentos>
          <Documento>
            <Descricao>string</Descricao>
            <PesoOrigem>decimal</PesoOrigem>
            <Estado>int</Estado>
            <Codigo>string</Codigo>
            <Data>dateTime</Data>
            <PesagemRealizada>boolean</PesagemRealizada>
            <Tolerancia>double</Tolerancia>
          </Documento>
          <Documento>
            <Descricao>string</Descricao>
            <PesoOrigem>decimal</PesoOrigem>
            <Estado>int</Estado>
            <Codigo>string</Codigo>
            <Data>dateTime</Data>
            <PesagemRealizada>boolean</PesagemRealizada>
            <Tolerancia>double</Tolerancia>
          </Documento>
        </Documentos>
        <Observacao>string</Observacao>
        <DataPesagem>dateTime</DataPesagem>
        <FatoresCorrecao>
          <ListaFatoresCorrecaoTicket>
            <Numero>int</Numero>
            <Descricao>string</Descricao>
            <Data>dateTime</Data>
            <Estado>int</Estado>
            <CodigoItem>string</CodigoItem>
            <Codigo>string</Codigo>
            <Fator>decimal</Fator>
            <ValorMinimo>decimal</ValorMinimo>
            <ValorMaximo>decimal</ValorMaximo>
          </ListaFatoresCorrecaoTicket>
          <ListaFatoresCorrecaoTicket>
            <Numero>int</Numero>
            <Descricao>string</Descricao>
            <Data>dateTime</Data>
            <Estado>int</Estado>
            <CodigoItem>string</CodigoItem>
            <Codigo>string</Codigo>
            <Fator>decimal</Fator>
            <ValorMinimo>decimal</ValorMinimo>
            <ValorMaximo>decimal</ValorMaximo>
          </ListaFatoresCorrecaoTicket>
        </FatoresCorrecao>
        <FatorCorrecao>
          <TipoFatorCorrecao>int</TipoFatorCorrecao>
          <CodigoTabela>string</CodigoTabela>
          <ListaFatorCorrecao>
            <VOListaFatorCorrecao xsi:nil="true" />
            <VOListaFatorCorrecao xsi:nil="true" />
          </ListaFatorCorrecao>
        </FatorCorrecao>
        <CamposAdicionais>
          <CampoAdicionalTicket>
            <Numero>int</Numero>
            <Valor>string</Valor>
            <Codigo>string</Codigo>
            <Data>dateTime</Data>
          </CampoAdicionalTicket>
          <CampoAdicionalTicket>
            <Numero>int</Numero>
            <Valor>string</Valor>
            <Codigo>string</Codigo>
            <Data>dateTime</Data>
          </CampoAdicionalTicket>
        </CamposAdicionais>
        <TagAssociado>string</TagAssociado>
        <UnidadeAposConversao>string</UnidadeAposConversao>
        <TipoVeiculo>string</TipoVeiculo>
        <AceitaPesoLiquidoZero>boolean</AceitaPesoLiquidoZero>
        <PesoAlvo>decimal</PesoAlvo>
        <Corte>decimal</Corte>
        <DosagemLenta>decimal</DosagemLenta>
        <PesoBruto>decimal</PesoBruto>
        <Tara>decimal</Tara>
        <PesoBrutoOrigem>double</PesoBrutoOrigem>
        <PesoMinimoOrigem>double</PesoMinimoOrigem>
        <PesoMaximoOrigem>double</PesoMaximoOrigem>
        <PesoTotalOrigem>double</PesoTotalOrigem>
        <Fluxo>string</Fluxo>
        <TipoDoFatorDeCorrecao>int</TipoDoFatorDeCorrecao>
        <OperacaoDaPesagemInicial>string</OperacaoDaPesagemInicial>
        <OperacaoPreCadastro>string</OperacaoPreCadastro>
        <PerifericoDaPesagemInicial>string</PerifericoDaPesagemInicial>
        <PesoDaPesagemInicial>double</PesoDaPesagemInicial>
        <DataDaPesagemInicial>dateTime</DataDaPesagemInicial>
        <EmbalagensTicket>
          <EmbalagensTicket>
            <Codigo>string</Codigo>
            <Nome>string</Nome>
            <Identificador>string</Identificador>
            <Data>dateTime</Data>
            <Peso>decimal</Peso>
            <Quantidade>decimal</Quantidade>
            <Sequencial>int</Sequencial>
            <SequencialItem>int</SequencialItem>
            <SequencialTck>int</SequencialTck>
            <CodigoTck>int</CodigoTck>
            <CodigoItem>string</CodigoItem>
          </EmbalagensTicket>
          <EmbalagensTicket>
            <Codigo>string</Codigo>
            <Nome>string</Nome>
            <Identificador>string</Identificador>
            <Data>dateTime</Data>
            <Peso>decimal</Peso>
            <Quantidade>decimal</Quantidade>
            <Sequencial>int</Sequencial>
            <SequencialItem>int</SequencialItem>
            <SequencialTck>int</SequencialTck>
            <CodigoTck>int</CodigoTck>
            <CodigoItem>string</CodigoItem>
          </EmbalagensTicket>
        </EmbalagensTicket>
        <ListaEmbalagensTicket>
          <VOEmbalagensTicket>
            <Codigo>string</Codigo>
            <Nome>string</Nome>
            <Identificador>string</Identificador>
            <Peso>decimal</Peso>
            <Quantidade>decimal</Quantidade>
            <IncluiAtualiza>boolean</IncluiAtualiza>
            <Tipo>int</Tipo>
            <Sequencial>int</Sequencial>
            <Estado>int</Estado>
          </VOEmbalagensTicket>
          <VOEmbalagensTicket>
            <Codigo>string</Codigo>
            <Nome>string</Nome>
            <Identificador>string</Identificador>
            <Peso>decimal</Peso>
            <Quantidade>decimal</Quantidade>
            <IncluiAtualiza>boolean</IncluiAtualiza>
            <Tipo>int</Tipo>
            <Sequencial>int</Sequencial>
            <Estado>int</Estado>
          </VOEmbalagensTicket>
        </ListaEmbalagensTicket>
        <Usuario>string</Usuario>
        <ReferenciaIntegracao>string</ReferenciaIntegracao>
        <NumeroTotalCompatimentos>int</NumeroTotalCompatimentos>
        <TipoIdentificacaoCompartimento>int</TipoIdentificacaoCompartimento>
        <MarcardoParaCancelar>boolean</MarcardoParaCancelar>
        <OCRMarcardoParaNaoValida>boolean</OCRMarcardoParaNaoValida>
        <MotoristaMarcardoParaNaoValida>boolean</MotoristaMarcardoParaNaoValida>
        <NumeroConteineres>int</NumeroConteineres>
        <Conteineres>
          <ConteinerVO>
            <Sequencial>int</Sequencial>
            <Descricao>string</Descricao>
            <Conteiner>string</Conteiner>
            <Data>dateTime</Data>
            <TicketSequencial>int</TicketSequencial>
            <Codigo>string</Codigo>
          </ConteinerVO>
          <ConteinerVO>
            <Sequencial>int</Sequencial>
            <Descricao>string</Descricao>
            <Conteiner>string</Conteiner>
            <Data>dateTime</Data>
            <TicketSequencial>int</TicketSequencial>
            <Codigo>string</Codigo>
          </ConteinerVO>
        </Conteineres>
        <PontosDoFluxo>
          <PontoDoFluxo>
            <Sequencia>int</Sequencia>
            <CodigoOperacao>string</CodigoOperacao>
            <EstacaoControle>string</EstacaoControle>
          </PontoDoFluxo>
          <PontoDoFluxo>
            <Sequencia>int</Sequencia>
            <CodigoOperacao>string</CodigoOperacao>
            <EstacaoControle>string</EstacaoControle>
          </PontoDoFluxo>
        </PontosDoFluxo>
        <CodigoContrato>string</CodigoContrato>
        <CodigoCalculoFatorCorrecao>string</CodigoCalculoFatorCorrecao>
        <CarretasSecundarias>
          <VOPlacaSecundaria>
            <PlacaCarreta>string</PlacaCarreta>
          </VOPlacaSecundaria>
          <VOPlacaSecundaria>
            <PlacaCarreta>string</PlacaCarreta>
          </VOPlacaSecundaria>
        </CarretasSecundarias>
      </DadosTicket>
    </CadastraTicketGuardian>
  </soap:Body>
</soap:Envelope>